// Задача 2: Задайте массив на 10 целых чисел. Напишите программу, которая определяет количество 
// чётных чисел в массиве.
// массив [6 7 19 34 3 1 4 7 9 1] => 3
// массив [1 8 43 4 55 60 3 2 1 3] => 4


Console.WriteLine("Задача 02 - нахождение значений в отрезке [20, 90] для массива из 10 целых чисел");

int[] array = new int[10];

Console.WriteLine("Получен массив:");
for(int i = 0; i < array.Length; i++)